## where to install homebrew-cask applications
cask_args appdir: '/Applications'

# set-up brew with taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# tap "mas-cli/tap" # in case I ever need apps from the App Store

# brew
brew "bat"           # rust-powered alt to `cat`
brew "coreutils"     # GNU replacements for OSX' garbo tools
brew "diff-so-fancy" # much nicer `git diff` visualizer
brew "fd"            # rust-powered alt to `find`
brew "fish"          # best shell ever
brew "fzf"           # rust-powered fuzzy finder cli tool
brew "git"
brew "node"
brew "openssl"
brew "postgresql"
brew "pv"            # monitor shell file download progress
brew "rbenv"         # lightweight ruby manager
brew "ripgrep"       # rust-powered alt to `grep`
brew "tmux"

# cask applications
cask "1password"
cask "adoptopenjdk" # screaming-frog-seo-spider dependency (java 7+)
cask "alfred"
cask "appcleaner"
cask "cyberduck"
cask "dropbox"
cask "firefox-developer-edition"
cask "gas-mask"
cask "google-chrome"
cask "iterm2"
cask "libreoffice"
cask "notion"
cask "p4v" # formerly p4merge
cask "paw"
cask "postico"
cask "screaming-frog-seo-spider"
cask "spotify"
cask "visual-studio-code"