## where to install homebrew-cask applications
cask_args appdir: '/Applications'

# set-up brew with taps
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap" # grab apps from the App Store

# brew
brew "bat"           # rust-powered alt to `cat`
brew "coreutils"     # GNU replacements for OSX' garbo tools
brew "diff-so-fancy" # much nicer `git diff` visualizer
brew "exiftool"
brew "fd"            # rust-powered alt to `find`
brew "fish"          # best shell ever
brew "fzf"           # rust-powered fuzzy finder cli tool
brew "git"
brew "gnupg"         # used for file encryption/decryption
brew "imagemagick"
brew "jq"
brew "mas"
brew "ncdu"
brew "node"
brew "pv"            # monitor shell file download progress
brew "ripgrep"       # rust-powered alt to `grep`
brew "starship"
brew "svn"           # needed by source code pro font
brew "tmux"
brew "z"             # directory jumper using 'frecency'

# cask applications
cask "1password"
cask "appcleaner"
cask "dash"
cask "discord"
cask "dropbox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"
cask "firefox-developer-edition"
cask "gas-mask"
cask "google-chrome"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
